{
  "id": "1769833877286-b7qvonp",
  "title": "Meeting for Software Testing & Database Assignment",
  "participants": [
    "JiYu",
    "Yuxin",
    "Yap",
    "Anny"
  ],
  "createdAt": "2026-01-31T04:33:14.232Z",
  "status": "completed",
  "transcription": {
    "text": "JiYu, Yuxin, Yap, Anny. 鸡肉是 chicken. 哦, wow, chicken, chicken. 嘿, 蚂蚁是什么叫? 英文? 我有一个, 已经买了. 你要用英语模式看. 你刚才还没说得够清楚. 那是谁的那个部位? 一个洞, 一个很重要的东西, 这个东西, 这个洞叫马严. 这个东西, 这样子插进去是爽? 没有, 它不是插, 不是插的东西, 那个洞叫做马严. 跟插没有关系, 正常人不会插这个东西. OK? 那时候是谁讲一个东西插进去? Anny 头脑有问题, 你不要. 我等下我这个 meeting 的那个音频可能要用. 哦, 你在录着? 你等下到那个我们的那个 demo show 一些奇怪的东西, 你不要问我为什么. 你以为我们最近只讲过这一次吗? 你以为我们讲这种话只有一次啊? 我们收正经一点好吗? 今天有两个东西, 一个是 database 的 table, 还有一个是叫什么? Software testing 的 module. 我们现在从 database 开始啊. 我那这时候看到, 我画一个照片在 group 里面. 太久远的东西了. 这个, SQL. 可是我是要问, 要做的那个 document 里面是没有加新的 table 的是吗? 我没有印象啊. 什么是加新的 table? 你的 table, 你在里面写... 我一个很严重的问题. Yes. 就是 before meeting 开始之前, 我想上个厕所. 你这些, 都是在这个照片里面有的. 哇, 应该 是啦, 感觉像, 像是有啦. 我没有做到 pickup. 哎呀, 应该大部分都应该... 哦, payment 我好像没有设置到. OK, 没关系. Payment 还有 pickup. 只是那个 member subscription, 我一开始有想过要做, 就是做所谓那种 VIP 这样子. But 最后我没有做, 因为我不知道你们要不要. VIP is aside no requirement. 哦是啊? 呜, 我还删掉, 我还在那里想, 要不要, 算了吧. 我在那里写什么 PS. 你们要就做啦, 不要就不要啦. 那个 member subscription 是, 你所谓的 subscription 就是像一个月 100 还是什么? 没有, 不是不是. 呃, 在这里要讲的是, 它有分成 normal member 跟 VIP member. 诶, 6 块钱一个月. 就好像 Foodpanda 有 Panda Pro 这样子. 哇, 去你的, what the hell, JiYu. 我还想做, 可以不要做, 我很开心的. 不要啦. 我想过我自己... 这里的表格都很单纯, 很少. 你有电吗? 哎, 还有啊. 嗯. 哎, 还有一个要做什么? 也要电, 喂. Admin 那种大, 或者是 supervisor 那些. Admin 大老板. 不是那, 不是老板的那种大妈. Admin 好听一点, 位子很高, 难听一点, 什么都做. 是咯. 垃圾桶, 负责杂工. 还要帮老板算账. 外劳的 working hour. 外劳的 working hour. 那种打卡, 打卡然后算他一个月赚了多少钱. 是咯. 可是这个是 system 哦. 我们的 database 在哪? 这个. 嗯. 它的 requirement 在下面. 所以是 assignment requirement. 然后 Yap 有做了一些, 诶, 你没有 database doc 吗? 没有. 这个也是 Yap 在画的. OK, thank you. 几时用完? 几时用完? 几时要用好? 哦. 12 点就要用好. 哦, SQL table. 也是问几时用好? 他 12 点就要用好. 哦. 我有带 charger. 我在这里想去拿电. 刚才那个, 我有个. 有一个外语啊. 哦, 爽. 5 块钱. 嘿嘿嘿, 算便宜了. 他讲 5 块钱. 因为你们全都在讲钱钱钱钱钱. 是咯, 不然怎么带一个过去. 你觉得我跟你不是谈钱的? 哎呀. 我们有什么感情? 没有什么感情对. 是咯. 臭脾气. 还没下课, 这边还有一个. 这么今天几时要插? Anny, 我在这里有写. 哇, 他还有写他的名字的咧. 哎, 那你刚才那几个那个, 这个是谁画的? JiYu. 你要更详细一点吗? 那不用, 这样就好. 哦, 那个其实挺烂的啊. 之前画那个叫什么, Do-A-Run 的. 哦, 你们现在的这个洞跟他的洞不一样? 我们有参加过蛮多个 hackathon. 哦, 我跟 Anny 有一个, 我跟他有一个, 他自己有一个. 应该是结束. 我们感情是结束了啊, 过完 hackathon. 嗯哼. 还没出生. 刚刚看到我跟 Anny 的 IG 是没有互相 follow 的. 最近刚刚跟他断交了. 刚刚讲什么? 哦. Database. OK, Anny 看一下. 现在要看你给, 你画出来的这个 table valid 不 valid, 然后有没有需要加, 有没有什么东西缺不缺. 对. 你们去看一下我发那个照片哦. 呃, 这个 table, 这个是 database 的 schema. So, 呃, 这个是还没有画好的啦. 我们要先探讨说这个 ERD 啊, 到底合不合理, 就我们该有的 module 有没有. Yes. 什么是 restaurant category? mamak, 中餐, 西餐, 日餐, 这样子咯. 我自己看是, 我觉得 OK 啊. 也是 OK. OK. 嗯, 既然你们觉得 OK, 那你们解释给我听. 你要我解释什么? 就是 What is the concept of this concept? 它整体最主要的是 member 跟 orders, 还有 restaurant. 你可以看到很多接线都是接在 order, member 跟 restaurant. So basically, 呃, 我想一下有什么要讲的. 我有一个问题. Yes. 为什么 order 会有一个 pickup? Pickup 是会 store 什么东西? Pickup 的时间地点. 哦, 这个东西, 它是其实是 one to one. But 因为我们有可能有 delivery 有 pickup, 所以我才把它分开放. 我不确定有没有必要这样子做. 什么是? 就是讲, 因为你一个 order 它有可能是 pickup 或者是 delivery 嘛. So 我才把 pickup 拉出来. Delivery 一定要拉出来, But pickup 我就不确定有没有必要拉出来了. 为什么 delivery 一定要拉出来, pickup 就不用? 因为 delivery 会有 rating. 呃, 其实不拉出来也可以. 因为都是 one to one. Member 有一个 rating delivery 是 one to one, rating delivery 跟 delivery 也是 one to one, orders 跟 delivery one to one, orders 跟 pickup one to one, delivery 跟 delivery man 也是 one to one. Delivery 的 data 和 pickup 的 data 会有什么不一样? Delivery 是不是会有一个 status? 是, pickup 也是有. 但是 delivery 会有地址那些东西. 可不可以月同一个, 就是改它的 status 而已? Delivery 会有地址. 可是如果 delivery 其实只是 store 多一个地址吧. My location 咯, 可能可以看到那个 motor 到哪里. My location, 你可以 store 这个. 那个... 不要, 不要. 没有做那个东西, database, 这个是 database. 好的, database 功德圆满, 我们没有要做 system 出来, 我们做 data. 呃, 刚才 Yuxin 讲什么? Yuxin 是讲... 哦, 刚才那个有 null 的问题. 哦是啊? 那时候... 等下有一个给份数什么的, null class 还是不是? 这样子的东西. 有, 有. 可是我不确定那个是什么啦, 但是... 我记得我有, 我想, 我可能是不是想要避免掉 null 的 data 还是什么. 可能我们可以放 null, 就是开一个 status 的名字出来嘛. 只是刚才 Yap 讲到一份 delivery 会有地址, 而且会有 delivery man. 可能 delivery man 这个东西比较好解决, 就是一个 order 可能会有 0 个 delivery man 或者 1 个 delivery man. 但是 delivery 这个地址这个东西在 pickup 我是不需要的. 嗯哼. 可是, 所以... 地址也可以放一个东西给它啦, 但是有一个顾虑是... 呃, 这样. 就是... 也可以, 参在一起会不会很乱? 有时候的确会很乱. 哦对, delivery table 除了 address 还有什么特别的? Delivery time, 到底的时间. 然后呃那个骑手拿那个食物的时间. 所以它会有 store 很多个时间. 嗯. 如果还没有到那个时间就是 null. 嗯. 就这样. 就这三种时间咯. 这样 pickup 也是一样嘛. 它的 data 其实跟 delivery 是一样的, 只是它的 process 有一点不一样. 流程不一样. 它有的 data 就 user pickup 的时间. 就这样. 就 pickup time 咯, 这种菲菲的东西. 而 delivery 也是 delivery number. Delivery 也会有地址, 有 pickup 地址什么的. 哦 delivery 东西会比较多. 什么是 member subscription? 在 assignment requirement 里面有讲它需要有一个 VIP member. User 可以 subscribe for 这个 VIP member. So VIP member 可能会有 voucher 或者 offer 这样子的东西. 所以这个 member 在这里也是 user 的意思啊? 嗯, 对. 为什么 member voucher 是连着 member 不是连着 member subscription? Member voucher 是讲这个 member 有的 voucher. 然后 user 也会有 voucher. 嗯, 好像我们用 Foodpanda, 我们买了会员才会有 voucher. Member subscription 会有什么 data? Member 的 level. Member 的... 目前在 assignment requirement 只需要有一个 VIP member 啦. 只有一个 level 罢啦. 对, 只有一个 level. 我记得我之前上过不懂谁的 class, 他其实是讲不需要再分开一个, 比如说它是 VIP 这样子出来, 它只要把 member 的那个, 它的... 比如说有一个种类. 哦, 有一个 type, 可能是 normal 或者 VIP. 哦, 有一个 type, 可能是 normal 或者 VIP 就可以. 然后当它要 offer 的时候可以 detect 这个 type 就好. 可是我在想, 要不要 store 它 register member 的时间? 或者如果... 我们的 system 是怎样? 我们是 assume... 呃, 这个 member 要 renew 还是已经是一进就是永久? 如果它要 renew, 就是讲它会有 member expire date. 我记得我之前做 member 的时候那个 expire date 这个东西都乱到乱七八糟. 我是没有. 它 renew ID 那些什么的. 它这里也是讲 6 块钱一个月. 所以就代表它是 subscription 的. 代表它会有 expire date. 这样如果它有 expire date, 我需不需要记录它之前 subscribe 的 member 的那些 period? 到最后讲要. 它的 history 咯. 所以 member subscription 会记录它的 history. 所以我们要换一个名字, subscription history? 或者叫 subscription? 所以呃, member subscription. 我改一下那个名字先, 它它的 primary key 会有 subscription ID 跟那个 member ID. 然后不同的东西就是 subscription ID, 每一次的 subscription ID 就会不同. Yeah. 还是我们要把 primary key 换成 date 跟 member ID? Register date 还是 renew date? 呃也不行, 还是有一个 ID, 还是有一个 subscription ID. 就这样, 这个 member... 这个新个 table, 然后有一个 subscription ID, 它的 date, 它的 member ID. 就这样. 是不是? 应该是. So 这个 table 还是有必要的. 嗯. 还有一个东西, 它 subscribe 的话需要有 payment. 它要 6 块钱的. 所以 member 是不是应该有一个或者一个 member payment 之类的? 还是直接 link 去 payment 的 table? 因为我们有一个 payment 的 table 在右下角. 这样 payment 记录的东西会一样吗? 这两个 payment 记录的东西? 如果是一样我觉得可以放在一起, 如果是不一样我觉得不可以放在一起. 我觉得是一样. Yuxin 觉得它的不一样的点, 我想, 呃... Pay for 什么东西咯? 唯一不一样的点, But 我觉得会是一个备注而已, 就 remark 讲这个是 for normal ID. 这种我觉得可以放在一起. 嗯, OK. 就 link 过去 member subscription 去 table. 哇塞, 我要画多一张. 这是它的 bridge table 来的, 是吗? Member voucher. Voucher 是它的不同种类的 voucher. 然后 member voucher 是那个 user 有的 voucher. 这个 voucher 就像是一个 base 这样子. 其实 bridge 是什么来的? 就是 many to many relationship 的一个 class. 好像之前我们做那个 DSA, 它有... 是有蛮多个 many to many. 啊, 然后我们就用 member 表同一个 table 去 solve 掉它. 但是我们有一个东西讨论很久了. 呃... 为什么 member 它还可以 rate for item? 这个, 哦, 这个也是我在思考要不要做的东西. 因为... 吧这个不就是我们的 additional module 咩? 我们有 rating. 啊为什么是 rate, 我不明白 rate for item 是怎样 rate? 如果食物, item 就是食物. 是有一点麻烦啊, 对于 user 来讲的话. 呃 assignment requirement 那些 manage the rating of restaurant, food and drink items and delivery service. So 它可能 rate 的时候 as user 角度它是一个一个去 rate 啦, 虽然很麻烦, but 我们就 assume 是这样子. 如果我要整个全部叫五星级也是可以. 全部五星级哦? 那我们就不用 design 那个 system 出去啊. 就这样. 不是, 是人家用的时候就会觉得很奇怪. 奇怪在... 我, 我 order 10 个东西 10 分给就是一个公司的 company. 它 rate 的时候每一个都要 rate 五星级, 按 10 次. 或者我们就 assume 它会 rate for 这一个食物, 然后但是它在 database 里面它还是会 store 给每一个 item 不同的 data. OK. 嗯我觉得我们可以 make assumption 是呃那个 system 报时啊, 所以 assume 就是它可以选择 select all 去 rate 完全部的东西. 哦, 或者还有 individual. Individual, 跟你讲那些食谱之后就有利益点. OK, 你就会 complain 好哪一个食物. 就是讲 rate item 这边它可以一个一个 rate 那个食物, 还是它一次过 rate 完全部的东西. 两个都可以, 它可以... 它一开始进去会让它选择一个一个 rate, 它又会有一个 checkbox 什么之类的 select all. 还有其他问题吗? 没有. No question. 我们需不需要做 group order? 诶? 那是什么? 我并没有如果有这个东西一样, 是什么样的 order? Order 外卖食物. 你们那个 order 是只有 from 一个 restaurant 还是可以 from 很多个 restaurant? 首先, 我没有外卖过. 不是, 听着. 通常来讲是一个 restaurant 罢了. 如果你要不同的 restaurant 的话, 你需要开不同的 order, 如果我没记错. 是这样子吗? 或者是像那个 Grab 做的那个东西. 我连 app 都没有. 唉, 浪费电. 我以为你要讲什么, 跟我讲. 我没有外卖, 不, 我没有外卖过. 我真的没有外卖过. 你们讲外卖我... 我唯一外卖过的东西就是 Domino's 罢啦. 对, 一间店一个 order. 如果你要不同的店的 order 你要分. 一个 account 诶? 什么一个 account? 一个 account 也是同时. 每一个 order 只有一个店, 没. 呃, 你可以同时, I mean 你每个 order 只有一间店, but 你可以同时有很多个 order. 在一个时间点哦. 哎呀, 就 order 另外一间咯. 哦, 这样. 呃, 这样我想问, 因为我记得有一个 additional module 是 group order. 我们会有 group order 其实是什么? 那个是 Grab 做的东西. 呃, 它可以开一个 link 哦. 算是拼单. 你开一个 link, 全部人在那个 order 上面点单. 然后... 就变成一个 order, but 是不同的人点的. 然后过后, 它会送到你选择的一个地方, 就 like 如果你是选 delivery, 它会送过来, but 其实是不同的人点的 order 来的. 这个叫 group order. 它在 database 会有什么不一样? 它只会多记录一个, 这个 item 的 user 是谁. 不知道. 如果他们拼单, 它是自己给自己钱. 可是它没有跟我收钱诶? 如果自己给自己钱, 那我们要分开 payment 吗? 连 payment 都要分开. 对, but 这种不是 group order. 是咩, 怎么你要问这个东西? 我们有个 group order 吗? 哦, 没有. Group order 是会完全不同的东西来的. 哦, 之前你们有讲到用 equipment, 我觉得那个现在用不到啊. 这种东西应该也没有在 list 里面. 嗯, 我也这样觉得. Rating 是订订订, 五星级. 还有一个问题, 这个东西可以做什么样的 report? 每一家 restaurant, 每一个 order 被喜欢的那个 rating. 或者食物. 或者 delivery man 的 rating. 或者... 呃, member 花了多少钱. 花了这样子的 amount 的钱的 member 的年龄层是多少? Voucher 使用率. 这些东西可以做 report. 嗯, 可以做 report. 好我们可以开始画. 嗯, 有一个东西我要问. 因为我突然想到 address. Member 是不是有很多个 address? 所以我们要把它分开出来吗? 嗯, many member have many address. One member have many address. 两个三个四个五个六个 address. 还有什么, 还有什么? 呃, Voucher. 我逛逛这个 Foodpanda. Voucher 跟 order 应该要连在一起哦. 就看这个 order 有没有用到那个 voucher. 诶好像要. 哎? 应该是 link 位 member voucher 吗? 对, link 位 member voucher, 这个 member 有的 voucher. 这样我拉过去一条线先. 我就是问你们, 我不确定它需不需要 link 在一起. 好像要. 好像要. 但是 link 的话哦, 我们价钱怎样算啊? 计算全部到了之后看它有没有 member voucher, 如果有的话就扣. 它要 based on member voucher 的 ID 来去找那个折扣来什么, 还是要我们直接 store 一个那个 voucher code 是多少? 呃, based on ID 吧. Based on ID. 这样我拉过去. 呃, 我刚才问什么? 呃... Payment method. 它需不... 没有, 需不需要一个 table, 让 user 有不同的 payment method? 我觉得可以啊, 毕竟我们是打一个支付宝, cash, card 这种. 不是, 呃, 不是这种. I mean, user 可能会 store 它的不同的 payment method, 比如讲它的卡, 它的 Touch 'n Go. 啊, 就它会绑不同的 payment method 的吗? 需不需要? 讲, 绑会比较合理啊. 我觉得不错, 我刚才先设置了这个 idea. 所以它会有一个 table 是 payment method. 记录这种东西. 然后这个 payment method 要 link with payment 这样. 要吗? 呃, 要吧. 记录这一次 payment user 用哪一个 payment method. 对. 诶我刚才看 order history 这里, 诶其实它没有写用什么 payment method. 然后它应该会有记录吧, 只是没有 show 给你看. 也有可能. 哦, 有, 它有写 pay with 什么. Pay with Panda credit. 像 Foodpanda 它是由自己的 wallet 的啦, but I believe 我们不需要做啦. 嗯哼. 就可以 assume 它都是... 都是用外面的 payment method. 还有什么, 还有什么? 让我看看. Favorite restaurant. 需要吗? 你们觉得需要? Favorite restaurant? 嗯. 我建议你们, 不需要的东西就别画了. 哦, 哦, 哦. 我觉得 favorite restaurant 就... 也就画看吧. 这些东西是要做 data 出来的. 哦, 竞电大家好. 呃, 然后 ChatGPT 会帮很多忙. 它的 data. Data 不用担心. OK. 画完这个 assignment. Favorite restaurant 那个是有什么? 画它最喜欢哪一个 restaurant, 可是我可以最喜欢哪几个 restaurant. 我不可以通过它的 rating restaurant 来看咩? 没有, 就纯粹是, 你在 find 的时候可能有一个 favorite 的 button, 按了之后它... 你就会觉得你每次会去这里吃了, 你就会从这里找. 这是一个很好的. 它有 Panda Pro. 我个人觉得不需要, 如果你们觉得一定要也可以. 我觉得对我们没有太大的帮助. 对. F 区教学楼. F 区教学楼呃呃呃呃呃呃. OK. 还有一个是什么? 这个, data 和. 这里的. 平常这个时候开歌会影响你收音? 不会. 吧, 我不知道诶. 随便啦, 应该不会. 它可以 detect 多一个背景音乐. 我 speaker 5. 我 speaker 5 在唱什么歌. 真的咩? 我不知道. 哎, 怎么停了? 他的音乐. 哦还在. Invite friend, refer code. 呃不要啦, 不要啦. 这个 system 还没做到那边. 你还要 randomly 去 build. OK, 应该没有了. 应该够了. 应该是够了. 够了. 够了. 够了, 够了, 够了. 够了. 没有, 我觉得够了, 我只是在 check 一下有什么细节我没有想到罢了. 细节, 这种东西... 这么我少了两个, 没关系. Order, item. 做完之后... 呃, 先不要画给我先, 我们需要... 选我们的 table, 然后弄它 attribute 出来. 嗯. 对. 对. 然后可以开始 create data 了. 嗯. 蛋... 弄, 弄, build 好之后就可以 create data 了. 对. 所以我们, 我们现在也是会用那个什么, 那个什么那个... Mokaroo? ChatGPT? Mokaroo. 呃, 不要用 Mokaroo, 应该... 什么 Mokaroo? 要 notion. 有 ChatGPT, 吧, notion. 跟 ChatGPT. 我们 leader 讲做就好. 那个 data 我会 generate, 你们不用担心. OK, 交给你了. OK, 搞定, 搞定. 搞定, 搞定. 我们先... OK, 画完这张. 我先发这个版本上去先. 里面有多少个? 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19. 你可以切一拍到去那里. 可以. 我还以为要画完之后再拍上去. 已经 label 好哪一个人做哪一个了. 哦哦, 也可以. 1 2 3 4... 几个? 20 个? 21 个? 诶, 我刚才算多少个? 18. 18 个. 如果我没听错就 18. 我填了 19. 我算多一次, 我算多一次. 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19. 19 个. OK, 19 个, 一个人五个. 其实跟我上次 database 做的 assignment 很像. 我们是卖面. 然后我们也是有 delivery 那些. 直到我们... 做飞面出来. 然后那个面的名字真的够奇怪. 你们叫什么名字? Let you eat my noodle. 还要叫下面给你吃. 两个男生的这段话题. 老师非常 OK, 我们... 先问老师先, 吧, 我怕等下被吊啊. 我问他, 可以吗, Let you eat my noodle. 老师讲 OK 啊. 哦 OK. 哦你问的是英文版啊? 呃, 是, 我问英文版. 我们不能写华语. 一个人五个, 我们给... 应该讲少一点的. 一个人的话, 我想拿 restaurant 的东西. 不懂有没有五个, 诶有啦. Restaurant, 包括 rating restaurant, item, restaurant category map, restaurant category. 呃... 等一下. 我想看吃饭. 吃饭? 我不吃饭吗? 刚才你没吃, 哦刚才你没吃. 刚才你们在吃, right? 刚才你们在吃, right? Yeah, sorry, 你刚才讲你拿 restaurant. Restaurant 是包括... Rating restaurant, item, 然后 restaurant 自己本身, 还有 restaurant category map 跟 restaurant category. 呃... Before that, 我先, 先分颜色给你们. 哦, 我要蓝色. 我要蓝色. 我要黄色. 粉红色. 我要黄色. Yuxin. 绿色. 我唯独把你把粉色给你。为什么? 我觉得我们有一场自己的逻辑在跑. 其实我也是画自己的. 紫色咯, 呃给你, 给你. Anny 刚才讲什么? Anny 你重复, 阿三. 对不起, 我刚才在... 考虑着其他东西. 你讲 restaurant 是吗? Restaurant 还有... Rating restaurant. Rating restaurant. 还有... Restaurant category. 是吗? Anny, 我不能讲话啦. 谁, 我没去吧? 嗯, 应该是我. 然后 category map 也是你的. 咦我应该是 item 吧, item, rating item 跟 order item. 是吗? 是这样拿吗? 我也不知道. 随便选咯. 随便选, 没有怎样, 一个人, 一个人一起来. Item, order item, rating item. 这样我是不是应该要拿埋 order 诶? 你要也可以. 我做 member. 还有? Member subscription, member voucher, voucher. 这个有多少个啊? 这个有四、五个. 你自己四个. 1 2 3 4, 1 2 3 4... 诶, Anny 四个, Yap 四个. 咦我也拿... 那你有拿什么? 我有 restaurant, rating restaurant, item... 哦 item 是你的, 哦... 咦如果你要... 酱我的话... 啊懂得了啦, order, delivery. 让我看一下那个. 啊 OK. OK, order, delivery, rating delivery... Order, delivery, rating delivery, pickup, 还有 delivery man 咯. 酱拿整包. 如果你在做 pickup 的时候觉得 pickup 没有必要的话, 你就跟我讲一声. 哦. 然后 Yuxin 你刚才拿 member voucher, voucher, member subscription, payment method. 我们还剩 1 2 3 4 5 6. 咦? 才五个而已. 四个... 还有一个呢? 还有一个是什么来的? Payment method 啊? 嗯. 我听. 咦剩下什么东西给你完咧? 剩下 address, payment method, rating item, order item 跟 payment. 就这五个咯, 然后我就没东西了. 啊? 为什么你还会有没东西? 你们一人拿五个, 15 个. 你就剩下四个是你呀. 不止有 19 个咩? 你们三个人一人五个, 就剩... 就 15 个啦. 诶, 我们总共有... 19. 我们 suppose 一个人四个吧哦. 哦, 算错了, sorry 啊, 数学不好. 酱我把 item 从你那里拿掉. OK. Yap 那里我把... 哎, 我想问. 咦? 不要问你. 呃, 我要问 Yap. 嗯, Yap, Yes. 除了那个 attribute 的 assignment 要记录 logo, 还有其他东西要 logo 吗? 我没印象咧. 我不确定诶. 我印象没有. 我... 那个是我画的. 可能我们每一次不管讨论什么都要记录下来, 我们的 decision 是什么, 几点几时几分秒. 是咯. 没事啦, 反正那东西好解决. 可是, 这种东西要很详细. 我先记录不到... 谁谁, 没办法. 哪一个? 我们那个 app 快点做好. 啊? 我们那个 app 快点做好. 这里的谁啊? 我不懂. 所以那个不是拿来下个礼拜用的啊? 是私人用的. 不不不. 如果我们自己都会觉得有用, 酱是不是 hackathon 已经赢了? 人家做的东西搞不好更有用呢? 没关系. 但是我印象中是没有啊. 我不知道吃什么免费好咧. 不要转那个问题, 就在那个项目的东西. 可是你啊, 刚才那个... 老师讲那个... 姨妈的, 呃 database 除了这个东西, 还有什么东西要讨论? 讨论... 表格? 嗯. 没有啦, 我是想, 如果这个东西为什么要讨论我们进 testing? Testing 我们是用什么做的? I think 是 GitHub. 我都... 还没有去考 GitHub 有什么东西. 你们先不要骂我一骗人, 刚才你应该没看 GitHub. 他刚才在那个上课的时候他有用 GitHub. 没有, 我还是要做 calendar, 我要做很多电, 跑不掉, 跑不到. 反正... 如果我可以看到某某小时以后仓库存储库的故事, 这不是一举两得. 因为你有 follow 我. 咦! 我发现咯, 我... 是真, 是真. Anny 你真的很想你, 每次哦有问题哦, 我就研究不到, 你一来一看到你就研究到了. 每个人都跟我讲过去. 是咩? 可能我们需要更有耐心地对我们的 database. 我刚才 refresh 了好多次都没有, 哎哟. 我也 refresh. 懂他在讲什么? 我发了那个 schema 在... 有拼中选这种? 还没. 我发 WhatsApp 了. 然后 notion 了. 然后 document, document. 我放在, 我放在... 这里的. 我放在 report graph 那里啊. 所以... 酱我们去画. 嗯. 我们可以开始... 画这个. 这个是... 这个是 rating delivery, delivery, delivery, pickup, orders. 我觉得把这个... 诶, 我画错两个, 没关系, 补画回来在这里. 哼. OK, 接下来. Software... Testing. Testing. 这个东西可以丢好啊. 那个老师可以丢好啊. 对. 这个洞... 我 iPad. 嗯. 上半段... Software testing. 好的. 所以我们要开始... 画那个 table. 没问题. 我有一个问题. Yes. 我们刚才 database 的 meeting 有没有涉及什么 assumption 之类? 应该没有哦? 应该没有什么特别的东西需要记录下来的吧? 都是 based on 老师的 requirement 罢啦, 只是... 嗯... 我记得我们刚有 assume 东西啊. 那个好像不怎么重要. 就是没有真的关系到我们的... 要做的 database 和 database 的... 那叫什么? Database 的 document. 我们有 assume payment 要有 payment method. User 有很多个 payment method, 算吧. 不是. 呃... 没有吧, 应该没有. 哦, assume 它还可以全部一起给 rating. 啊, 我还在想这种技术上的东西, 怕, 怕它... 这样就不叫... assumption 啦. OK, 搞定了. 掰掰. 掰掰. 下次见啦. 你还敢看话. 掰掰. 掰掰. 哦对了, assignment assumptions 出来. OK. OK, 搞定了. 掰掰. 我们 database 搞定. 搞定. Anny 精神状态不怎么样. 那里会不懂? 啊那是真实的 Anny, 你不认识 Anny. 如果 Anny 很正经地跟你讲话, 那她一定是精神失常. 差不多. 怎么... 哎, 这是 Yap 是吗? 我以为 Yap 把 Yap 的 assignment 都做好了. 下午一下, 正在点点点. 什么点点点? PYQ. 啊, 正在念那个 past year question. 嗯, 我跳过去. 好了, Yap 那个 assignment 做好了. GitHub 里面有什么东西? 也是模块是吗? 对, 然后你需要... 拿 data 来 test. 呃, module. 只是给那个老板先找 module 先, 让他把找报我不用找啊. 其实很多啊. 呃, OK. 就最简单的是... Authentication. Testing. 所以我们要... 拿上 module, 然后找出那 module 两个 functionality. 嗯然后它的 functionality 是要有可以有 error handle- handled- handled. 然后需要有五个 test cases. 每一个那两个 functionality. Test cases 可以不用想先, 我们就过后再分一下谁拿哪一个. OK. 那个 O-One Thing 没有来就拿最后一个了. OK. 通常没有来的选剩下的咯. 五个 test case 什么意思? 一个人五个 test cases. 嗯有成功例子, 有错误例子. Test case 应该是两个 functionality 拿其中一个写五个 test cases. 呃... 如果你要... Create new repository. Act as a, I mean repository module 当做一个 module 可以吗? Repository module, 酱 create new repository module 会有什么 functionality? 它需要有 repository name, 然后 choose either public or private. 一个 README, 一个 gitignore. 一个 license. 把这个我们怎样做一个错误的例子咧? 除了这个名字罢了. 我这个随便打也是可以不是咩? 如果 import... 没有, 那个不可以有... 呃... 哦我必须先 check for availability 先. 可以 check 是不是 empty 啦我知道. 然后... 不可以有符号. 咦? 哦它直接改掉, 啊这个也算是一种 error handling 咯. 它把这种符号换成这种可以用的符号. 它的 functionality 是这个, 还有下面那些. 哦, 下面这些应该没有什么好 test 的啦. 还要多一个 test 才可以 test 完. Yeah, 拿 import 来讲. 放一个假的 URL 进去. 这个假的 URL 有什么可以 handle handling? Check whether it is a... GitHub 会自己 check. 是不是? 嗯, 它要自己去 check. Whether 它有没有... 是不是真的? 应该是吧, 可能是这种. 你看我... 还是我现在这个 input 也算? 什么意思叫 input 也算? 你现在帮它打的那一个字其实也算是一种 functionality. 我在想我们那个 functionality 是怎样算是一个 functionality? 是 create repo 是一个 functionality? 啊, 对. 对, 登录 login 也是一个 functionality. OK. 它可以用很小. 酱如果是 forget password. 呃, URL... 酱麻烦的那么这个. 吧这个... 这个不怎么好诶. 可以不要吗? 我去... 呃, 啊 URL must be valid 咯. 然后如果那个 repository 不存在的话也会 valid 的. 呃, 它除了可以 create repository 还可以做什么? Manage. 呃, OK. 吧... 这里好像没有 error handling. Upload file, create new file. 这个是... 这个是 manage, upload file 跟 create new file. 嗯, create repo 是不是算 create new file? 也不算. 它不算. 它只是 create 一个 repo 罢啦, 不是 create 这个 repo. 只是 CRUD file, 我可以叫你这样放. 可以. 然后 authentication module 就是 sign in sign out 啊. 还有 register. User student 的那个... 你刚才好像讲过不要 sign up 不是咩? 没有啊, 呃我讲不要拉出来成一个新个 module. 哦哦. Register student 的那个什么东西什么分... 哦 EDU. 啊, 那个好像要... 啊. 登记, 那个 EDU module 吗? 然后看, 到时候你们再选自己选哪一个. 我觉得 Education 单单都可以是一个 module 上的. 够东西吗? 我觉得够. 我觉得够, 因为里面它本身就要拍照那些. 啊. 嗯. 对. GitHub. Alias. 哈哈哈哈哈哈. 然后, GitHub 也可以, 或者是 repository 里面啊, 可以有 issues 跟 pull request. Issue 跟 pull request. 不确定要不要是一个 single module. 不确定要不要是一个 single module. 它其实还有 project, Github action, Insights. 呃 Insights 应该没有什么东西. 哦 repository 也可以改 setting 诶. 改 setting. Manage setting 啊. 哦. OK 酱不用想那么多, 最后两个选择这些。 I mean, 这个 issues 跟 pull request 你可以把它当作不是 under repository. 嗯, 我放 Notion 先. 呃, 我会觉得其中一个. 看一下啊. 这个是什么来着, GitHub project. GitHub project 不错. 呃可是我不懂. 它里面有什么东西. 我怕它很自由诶. 很自由就没有什么东西可以 test 它, 我觉得. 不懂, 不确定. Add item, new issue, add item from repository. 呃, 哦它这个是 link with GitHub issue 的还是? 酱 GitHub issue 那个 issue 跟 pull request 是可以放进 GitHub project under 它的? 不确定, 看一下. 不要理先, 我怕它很难做. GitHub action 就不做了. 不要. 别做. 我们可以讲 code 的 error handling 吗? 比如 GitHub action. 哎呀, 酱有点不好. 意思是不好的. 可以不要吗? 我想去... 呃, 啊 URL must be valid 咯. 然后如果那个 repository 不存在的话也会 valid 的. 呃, 那个 copilot 是不是也可以变成一个 module? Copilot 要怎样 test? Agent. 可以选 branch, 可以选 agent, 选 new chat. 可以选 models. 可以 configure. Configuration 咯, 如果你要讲的话. 很勉强啊. 有点, 很勉强, 不建议. 然后 Github issue, new issue. New issue 这里好像也是没有什么... 那个 codespace 是什么来的? 在哪里? GitHub 这里的 codespace. 好像是网上的 IDE 啊. Online 的 visual studio code 的感觉. 可以下什么? 可能可以. 怎么还可以选 machine type. What the hell? 1 0 0 1 1 0 0 1. 哦. 哇这么快啊. 嘻嘻, 其实其实其实这个 visual studio 跑得很快的. 老师咧, 我们可以开 meeting 的. 蛤? 我们可以开 meeting 的. 它还可以 share screen 的, GitHub. 没有没有, 诶不需要这样子. 哦没关系啦, 我只要... 我只要抄 memo, 让我抄一下. 感觉你们看得很辛苦, 大家看得辛苦. 还好. 你要讲还好, 就是... 我们应该把它电脑让出来这样. 它可以在这里. Long for 不了. 基本上不能, 所以它才这样子。 就 online 的 VS code 咯. Online 的 VS code 其实应该会有很多东西可以去测试, 比如讲它在这边... 酱像是啊. Push 或者打一些 CLI 的一些. 可是会有一个问题是, 我们的 functionality 会很像. 很像. 跟那个刚才有一个什么 issue pull request 的东西很像, 会有 manage repo 的东西很像. 去死吧. 刚才讲的那两个是... 刚才那个 repository module 有 create repo, manage repo 这些东西, 它会不会很像? 不太一样吧. 不太一样, OK. 因为... 因为它也是 create, 也是在 manage. 只是它不是 create repo 或者是 manage repo. 我不确定这两个东西是不是真的. 不一样吧? 不一样, OK. 只是它 under pull request 啦, under 那种 commits 的东西. 这里如果你讲 commits 的话, Git 的东西啊, 就是全部一起. Commits, pull request, branch... 酱你觉得可以作为一个其中一个 testing 的 module 吗? 是可以的. Codespace. 在它的, 我在想, module 的名字是要以 Git 为主还是以 Codespace 为主? 还是 Codespace, 然后一个 dash, 后面括号有一个 Git. Something like that. 我觉得它算是 codespace 的 submodule. Codespace 里面的 Git 咯. 几个 module 哦? 呃 repo, authentication. 它那个 project 刚才有讲吗? 目前确定的有三个啦, codespace, authentication 跟 repo. 有 no sure 的是 issue 和 pull request. Issue. Issue 这里. 不确定多不多东西 test 诶. 你们现在是讲在讲着 test item 啊? 哦, 对. 我们要找出那个, 那个 module 可以 test 的 functionality 是什么. 你们刚才是不是少讲了一个 EDU 的那个? 哦, EDU. 酱我放 under authentication. 可是你们觉得要拉出来? 拉出来拉出来. 如果拉出来一个的话, 它的两个 functionality 会是什么? 呃... 申请跟... 注册? 咦, 注册好像是两个. 还是 check status? Check status 好像没有什么东西 test. 我刚还在想, 补录拉出来, 它很像这个东西也就是给注册东西罢了, 注册后会有这个... 它只有一个 process 罢啦, 就是让我们注册. 除非把它里面的 step 拉出来咯. 就第一个 step 是一个 functionality. 嗯. 我不太想. 就像第一步骤, 第一步骤是它要我们的 email 那些吗, 那个算一个步骤而已. 你通过了第一步你才能通过第二步的吗, 酱我就把第一步是一个 functionality, 第二步就是另外一个 functionality. 你不要做酱冒险的事情. 冒险, 我觉得冒险是因为我不懂它什么接受. 哦对了. 哦像如果你要它让你 upload 一些照片啊, 我记得还有这个东西. Upload 照片你不能有 error handling. 也有啦, 可能那个 MB 的那边方面. 如果要做我觉得可以, 像 Yap 刚才讲的. 然后它第二个部分它那个基本上是 upload 东西那边. 放着先啦. 哦真的, 真的找不到. 他不给啊, EDU. 既然这个... 既然这个不要... 那... 我们叫什么? GitHub action? 我们讲 code 的 error handling 呀. OK. 呃, error handling. 就讲, 在 GitHub 里面有一个东西叫 GitHub action, 它会每天自动帮你跑一个东西. So, 呃, 我们就讲... 我就拿我的 calendar 为例啊. 它会跟 user 讲 whether 它是... 这个全部是成功. 成功还是失败, 在这里你会看到打勾跟叉. 有什么东西可以 test? Test 到那个工作流哦, 可以 create new workflow. 嗯. 哇, But 通常是在 code 里面写啊, 我没有试过在这里面开. 它里面其实是这样子的. 记录一二三, 是不是要普通一个? 怎样做 error handling? 第一点是如果你的 workflow 有问题的话, 你 workflow 是错的话它会跟你讲. 就假设你在这里面有 syntax error, 它会在... 这里跟你讲. 所以当你 create workflow 的时候这算是一个 functionality? 嗯. 然后呃... 这一... 这是一个 functionality. 还有什么东西可以 test? 哎, 这里的, 这全部都在那个. 我看一下如果我随便弄一个... 这一全部都打包了. 我下面还有呢. 好像 input 也没有讲很多. Input 就主要是在 code 那里, 除非我们能想到很多个不同的 scenario 咯. 就讲, 这种可以加这个东西. 哪一个? 这个. 不能挑他们之间的关系啊. 这个是给你 show 出它整个 process 成功还是失败. 它只是 show 罢了. 嗯. GitHub. Action. 除了 create 之外... 你讲 input 的话, 有一个东西是 user 的 account. 呃, 这个有点... 很 generic, 就 like 它不是专门 for action. 哦是哦. 如果我讲 pull request 的话. Pull request 刚才有讲过吗? 哎哟, 可是它不是 under 哪一个 module. 把 pull request 当做一个新个 module. Pull request 有 create pull request 跟 merge pull request. Open update 或者 merge pull request 啊. I mean 它是三个东西啊, 就 depends 咯. Create repo 是一个. Authentication 是一个, login. 然后... 还有两个对吧? GitHub action 就不要咯. 不要. 把 pull request 当做一个 module 咯. 还是 merge. Merge conflict. Merge conflict. 嗯. 怎样有 error handling? 如果, 如果它有 merge conflict 它就会让 user review. 那个就算它的 error handling. 算吧. 所以我们这个 module 和我们的 functionality 我等下给老师看一下, 不确定能不能. 嗯, Yes. 我看那个东西啊, 如果 Let's say Education 有一点点牵强, 这个东西叫做呃 GitHub... Classroom. Classroom. 为什么它的属性不一样? 是这样子的. GitHub classroom 它本身是一个 education 的 product, 然后基本上是如果你要讲它的 functionality 的话就很多了. 比如, 像 create classroom, create assignment... 酱子的东西. 然后 for education 本身, 好像我们的那个呢, 它更多偏向于... 它是属于 GitHub education 的 account 跟我的 access, 所以的确如果你是讲说它有一点点像, 所谓的这一块 account, 所以 Yeah, 酱子咯. GitHub classroom 除了可以 create classroom, assignment, 还有什么? 呃, 还有很多. 还有比方说你要怎样让 student 去 join 这个 assignment, 然后还有 roster management, 就是到时候你要 add or remove student. 甚至它还有那种什么 plagiarism tool 之类的东西. 好, 我选这几个到时选那个 module 还是自己选, 选哪个 functionality. 所以目前有六个 module 了. But 当然你们也可以 try 一个东西叫做 Student Developer Pack. 或许... Student Developer Pack 不就是注册那个 EDU 都有的。 应该是。 列出。 Search... 哦 Search, 对, search for repo. Search for repo 还可以做. 啊, 随便讲过. 还没有惊人发言. 没有我刚才想到跟... 上次我们是 search 机票那种. 哦, 就跟 search repo 是一样的概念, 可是想想下好像也没有什么东西. 如果你要做那个 classroom 哦, 你需要去注册一个 organization. 嗯. 画完这几张, 我觉得画完这几张没有电了. 它出汗了. 哦. 你, 你要查电脑的话拔掉我. 我还在中间. 你们有一个大问题啊, 就在下课. 马酱耶. 什么感情绰? 就是它原本那个. 需要拿上一个姨吗? 刚才被那个弄到了. 哦, 塞啊? 哎呀, 这个人才啊. 哦, 他选择了 GitHub back center 是吧. No problem, 我觉得他妈这名字是... 上一个姨吗? 啥? 你的插头在那边上一个姨吗? 是买... 弄坏了. 不懂. 那个睡乎也在晒太阳. OK OK, 我们现在有六个 module 还有什么东西? 那些水分都在喊救命啊, 真的吗? 等下给它过. 还有什么, 还有什么? 呃... 让我思考一下. 我们几时做 software testing? 哦, 下礼拜. 星期一. 等下两点上课. 哦, 你... 等下两点上课, 你不要跑. 等下还要读考. 我觉得没毛病啊, 应该可以. 现在每一个人选一个, 找五个 test case, 然后我们放进 Notion. 啊, 搞定. Classroom 我提的, 我做, 酱我 repo. 咦, 刚才我再思考一下选哪一个. Authentication 最容易其实. 惊华. 这个 authentication. 等一下. 选这个单字. Any 帮我写, Any 帮我写. 嗯... 选这个单字. Any 帮我写. 这是那个 data. 这个 meeting. 今年 DEMO 画, 今年 DEMO 画. 这一年里. 他都跟建华千手了, 跟建华牵手了, 跟你还有什么不可能? 还是我那个. 蛤? 选哪一个. 敢, 敢. Any. 你觉得 create repo 比较简单还是 create 一个 PR 比较简单? PR. Pull request. Create repo 还是 create 一个 pull request 简单一点? 报错的东西. GitHub. GitHub. 哦, 酱是 create repo 吧. 他讲 create repo. 既然你有道理. 等下你跟建华收两块钱. 你拿哪一个? 等下. 谁欠我妈多钱了最近? 没有咧, 刚才建华... 刚之前加加加. 你欠我 200 块, 你都没有还我. 说话要小心点, 诽谤, 诽谤要坐牢的. 你有证据讲我诽谤咩? 哎呀, 什么都没有, 刚才建华. 所以咯, 所以你欠我 200 块你是还呢. 该还, 该还. 嘿嘿. 好啦, 我听大概拿到了几个, 剩下你的还没有拿到. 这我等下拿给. 我拿 codespace. 准备. 有啦, 你拿 codespace 啦, 我帮你在拿 pull request. 哼. 这种也可以拿 student edu account. 看咯. 嗯, 不知道做不做得倒啊. 哦不是, 因为我们申请过后的, 我们不一定可以 test 到. 诶, 刚才那个. 我慢点有申请过吗? I don't know, 但是如果你要 test 的话, 你一定要申请很多次了嘛, 不是吗? 除非你不要按最后那一步啊. 酱这个画掉吧. 比较好. OK. OK, 所以我们现在决定了这个, 决定了那个, 我们 for testing 我们有什么要写的吗? 什么 for testing 有什么? 没有, 有什么要自己 proceed 的吗? 呃, 自己去找 test cases, 五个. So that 我们, so that 我们跟老师讲. Test case 是 based on functionality, 就是可能两三个两三个分. 给, 给你, 随你怎么样都可以啦. 只要是一五个我相信也不是问题啦. 吧你尽量选那种 test case 是有对有错的, 因为 Miss Agnes 有讲说如果你所有东西都太顺, 你的分数就酱子罢. 如果你想要... 所以不要给太顺, 老师给我低一点, 哦不给. 没有, 就是因为很像你在过后你要 design 的时候你要想的吗, 你, 你要怎样, 怎样 design, 怎样解那个 error, 如果 user 打到有 error 出来. 你后面你要想到你后面, 你有我的 issue. 没事, 还像不用打. 好. 酱子... 下个周一之前. 我们搞定. 直接拿东西给老师. 拜一什么, 拜一没有上课. 哦, 拜三之前. 其实你直接放拜三之前啊. 拜一拜二应该都是假期. 咦真的有这种话? 嗯. 酱我们下一堂课是几时? 呃, 拜四. For 那个 tutorial, 拜三是 lecture. 听咯. OK, 所以要去找 test cases, 呃跟... Database 需要去找 column. 我们的任务就酱. 是吧, 是吧. 你确定你要, 你不要教我们 create data? 还是要用 AI, 很快. 我是叫 AI 写 python code generate 罢啦, 没有什么. 哦, OK. 就纯粹就在 notion 里面跟他讲了, test 了, import. Import 有问题, 刚才讲什么问题? Generate 新个 import. 就酱咯. OK 大概跟你们讲怎么做啊, 我做到了 show 给你们. 整个 process 基本上就是, 我会先教它. 做好的 table 的东西啊, 把 create table 的这几 code 丢给它作为 reference, 它就知道那些 relationship 的东西, 然后我叫它 based 那个 create table generate 一个 python code 来 generate data 给我. 然后我就... 然后我就一直在 debug. 整个 process 是酱子罢. 如果你们要, 你们也可以自己做看啊. 嗯, 如果你酱. 我们拿现成. 既然你教自己拿下来呀, 就给你啦. 好的. Sorry. 这是它的 Panda Pro. 还有什么吗? 老师? 这几天你们有没有上课? 酱... 既然. 诶. 我下礼拜不想做功德, 我要在家里休息. 拜三... 拜三是 2 点上课. 吧我们上课之前是不是要先吃个龙虾? 行啊, 走起. 走起走起. 你有道理. 虽然是蓝色. 去哪一次? Pheromone 呀. 我只拿这么东西去那边. 去去外面等我, 我们去.",
    "segments": [],
    "speakers": [],
    "duration": 0
  },
  "audioPath": "uploads/1769833877286-b7qvonp/audio.m4a"
}